src/Catalogs/Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Файлы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.РеестрПлатежей</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаСогласование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоЗаголовок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВБазе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ОбщегоНазначенияВызовСервера/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ СОДЕРЖИТ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С БД
// - установка и получение значений параметров сеанса
// - обработка запуска приложения
// - получение значений реквизитов объекта
// - удаление данных приложения
// - удаление объекта
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Получает значение любой константы.
//
Функция ПолучитьЗначениеКонстанты(ИмяКонстанты) Экспорт
	
	Возврат Константы[ИмяКонстанты].Получить();
	
КонецФункции

// Устанавливает значение любой константы.
//
Процедура УстановитьЗначениеКонстанты(ИмяКонстанты, Значение) Экспорт
	
	Константы[ИмяКонстанты].Установить(Значение);
	
Конецпроцедуры

#КонецОбласти

// Получает все файлы вложения по указанному объекту.
//
// Параметры:
//  Владелец - СправочникСсылка, ДокументСсылка - Объект-владелец файлов.
// 
// Возвращаемое значение:
//  Массив - Массив найденных вложений.
//
Функция ПолучитьВложения(Владелец) Экспорт

	Вложения = Новый Массив;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ВладелецФайла", Владелец);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.Ссылка,
		|	Файлы.ТолькоЗаголовок,
		|	Файлы.Представление,
		|	Файлы.Размер,
		|	Файлы.Расширение
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.ВладелецФайла = &ВладелецФайла";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		Вложение = Новый Структура();
		Вложение.Вставить("Ссылка",Выборка.Ссылка);
		Вложение.Вставить("ТолькоЗаголовок",Выборка.ТолькоЗаголовок);
		Вложение.Вставить("Представление",Выборка.Представление);
		Вложение.Вставить("Размер",Выборка.Размер);
		Вложение.Вставить("Расширение",Выборка.Расширение);
		Вложение.Вставить("ИндексКартинки", 
			ОбщегоНазначенияКлиентСервер.ПолучитьИндексПиктограммыФайла(Выборка.Расширение));

		Вложения.Добавить(Вложение);

	КонецЦикла;

	Возврат Вложения;

КонецФункции
